-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 27 2021 г., 21:44
-- Версия сервера: 8.0.19
-- Версия PHP: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `kemgu_classes`
--

-- --------------------------------------------------------

--
-- Структура таблицы `times`
--

CREATE TABLE `times` (
  `number_of_class` int NOT NULL,
  `start` time NOT NULL,
  `end` time NOT NULL,
  `saturday_start` time NOT NULL,
  `saturday_end` time NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `times`
--

INSERT INTO `times` (`number_of_class`, `start`, `end`, `saturday_start`, `saturday_end`) VALUES
(1, '08:30:00', '10:05:00', '08:30:00', '10:05:00'),
(2, '10:15:00', '11:50:00', '10:15:00', '11:50:00'),
(3, '12:30:00', '14:05:00', '12:30:00', '14:05:00'),
(4, '14:15:00', '15:50:00', '14:15:00', '15:50:00'),
(5, '16:00:00', '17:35:00', '16:00:00', '17:35:00'),
(6, '17:45:00', '19:20:00', '17:45:00', '19:20:00'),
(7, '19:30:00', '21:05:00', '19:30:00', '21:05:00');

-- --------------------------------------------------------

--
-- Структура таблицы `кс-981`
--

CREATE TABLE `кс-981` (
  `day` int NOT NULL,
  `number` int NOT NULL,
  `is_odd_even` tinyint(1) NOT NULL DEFAULT '0',
  `is_groups` tinyint(1) NOT NULL DEFAULT '0',
  `class` varchar(64) NOT NULL,
  `class_even` varchar(64) NOT NULL,
  `class_odd` varchar(64) NOT NULL,
  `class_gr1` varchar(64) NOT NULL,
  `class_gr2` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `class_even_gr1` varchar(64) NOT NULL,
  `class_even_gr2` varchar(64) NOT NULL,
  `class_odd_gr1` varchar(64) NOT NULL,
  `class_odd_gr2` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `кс-981`
--

INSERT INTO `кс-981` (`day`, `number`, `is_odd_even`, `is_groups`, `class`, `class_even`, `class_odd`, `class_gr1`, `class_gr2`, `class_even_gr1`, `class_even_gr2`, `class_odd_gr1`, `class_odd_gr2`) VALUES
(1, 3, 0, 0, 'Правовое обеспечение (610ВЦ)', '', '', '', '', '', '', '', ''),
(1, 4, 0, 0, 'Системы и сети (610ВЦ)', '', '', '', '', '', '', '', ''),
(1, 5, 0, 1, '', '', '', 'Английский (104)', 'Базы данных (610ВЦ)', '', '', '', ''),
(2, 3, 0, 0, 'Физ-ра (Спорт-зал)', '', '', '', '', '', '', '', ''),
(2, 4, 0, 0, 'WEB-design (69ВЦ)', '', '', '', '', '', '', '', ''),
(2, 5, 1, 1, '', '', '', '', '', 'Системы и сети (610ВЦ)', 'WEB-design (69ВЦ)', 'WEB-design (69ВЦ)', 'Системы и сети (610ВЦ)'),
(2, 6, 1, 0, '', '', 'Базы данных (610ВЦ)', '', '', '', '', '', ''),
(3, 3, 0, 0, 'Правовое обеспечение (610ВЦ)', '', '', '', '', '', '', '', ''),
(3, 4, 0, 0, 'Системы и сети (610ВЦ)', '', '', '', '', '', '', '', ''),
(3, 5, 0, 0, 'Экономика (610ВЦ)', '', '', '', '', '', '', '', ''),
(3, 6, 0, 0, 'Базы данных (610ВЦ)', '', '', '', '', '', '', '', ''),
(4, 4, 1, 0, '', 'Экономика (610ВЦ)', '', '', '', '', '', '', ''),
(4, 5, 0, 0, 'Системы и сети (610ВЦ)', '', '', '', '', '', '', '', ''),
(4, 6, 0, 0, 'Базы данных (610ВЦ)', '', '', '', '', '', '', '', ''),
(5, 1, 0, 0, 'Системы и сети (610ВЦ)', '', '', '', '', '', '', '', ''),
(5, 2, 0, 1, '', '', '', 'Базы данных (610ВЦ)', 'Английский (104)', '', '', '', ''),
(5, 3, 0, 0, 'Базы данных (610ВЦ)', '', '', '', '', '', '', '', ''),
(6, 2, 1, 1, '', '', '', '', '', 'Базы данных (610ВЦ)', '', '', 'Базы данных (610ВЦ)'),
(6, 3, 1, 1, '', '', '', '', '', 'Базы данных (610ВЦ)', '', '', 'Базы данных (610ВЦ)'),
(6, 4, 1, 1, '', '', '', '', '', '', 'Базы данных (610ВЦ)', 'Базы данных (610ВЦ)', ''),
(6, 5, 1, 1, '', '', '', '', '', '', 'Системы и сети (610ВЦ)', 'Системы и сети (610ВЦ)', ''),
(1, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 7, 0, 0, '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Структура таблицы `кс-982`
--

CREATE TABLE `кс-982` (
  `day` int NOT NULL,
  `number` int NOT NULL,
  `is_odd_even` tinyint(1) NOT NULL DEFAULT '0',
  `is_groups` tinyint(1) NOT NULL DEFAULT '0',
  `class` varchar(64) NOT NULL,
  `class_even` varchar(64) NOT NULL,
  `class_odd` varchar(64) NOT NULL,
  `class_gr1` varchar(64) NOT NULL,
  `class_gr2` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `class_even_gr1` varchar(64) NOT NULL,
  `class_even_gr2` varchar(64) NOT NULL,
  `class_odd_gr1` varchar(64) NOT NULL,
  `class_odd_gr2` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `кс-982`
--

INSERT INTO `кс-982` (`day`, `number`, `is_odd_even`, `is_groups`, `class`, `class_even`, `class_odd`, `class_gr1`, `class_gr2`, `class_even_gr1`, `class_even_gr2`, `class_odd_gr1`, `class_odd_gr2`) VALUES
(1, 1, 0, 0, 'Право (609ВЦ)', '', '', '', '', '', '', '', ''),
(1, 2, 0, 0, 'БД (609ВЦ)', '', '', '', '', '', '', '', ''),
(1, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 3, 0, 1, '', '', '', 'Английский (104)', 'Сети (610ВЦ)', '', '', '', ''),
(2, 4, 1, 1, '', '', '', '', '', 'Английский (104)', 'БД (610ВЦ)', 'Английский (104)', 'БД (610ВЦ)'),
(2, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 5, 0, 0, 'Физ-ра (Спорт-зал)', '', '', '', '', '', '', '', ''),
(3, 6, 0, 0, 'Физ-ра (Спорт-зал)', '', '', '', '', '', '', '', ''),
(3, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 5, 1, 1, '', '', '', '', '', 'Вот такие дела', '', '', 'Дела вот такие'),
(4, 6, 1, 0, '', 'Мдееее', 'еееедМ', '', '', '', '', '', ''),
(4, 7, 1, 0, '', 'БД (610ВЦ)', 'Сети (610ВЦ)', '', '', '', '', '', ''),
(5, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 3, 1, 1, '', '', '', '', '', 'Новый предмет (105)', 'Старый предмет (610ВЦ)', 'Старый предмет (610ВЦ)', 'Новый предмет (105)'),
(5, 4, 1, 1, '', '', '', '', '', 'Устал придумывать', '', 'Придумал всё равно', ''),
(5, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 1, 1, 0, '', 'Сети (610ВЦ)', 'Сети (321)', '', '', '', '', '', ''),
(6, 2, 1, 1, '', '', '', '', '', 'Русский язык (321)', '', 'Русский язык (321)', ''),
(6, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 7, 0, 0, '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Структура таблицы `пс-982`
--

CREATE TABLE `пс-982` (
  `day` int NOT NULL,
  `number` int NOT NULL,
  `is_odd_even` tinyint(1) NOT NULL DEFAULT '0',
  `is_groups` tinyint(1) NOT NULL DEFAULT '0',
  `class` varchar(64) NOT NULL,
  `class_even` varchar(64) NOT NULL,
  `class_odd` varchar(64) NOT NULL,
  `class_gr1` varchar(64) NOT NULL,
  `class_gr2` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `class_even_gr1` varchar(64) NOT NULL,
  `class_even_gr2` varchar(64) NOT NULL,
  `class_odd_gr1` varchar(64) NOT NULL,
  `class_odd_gr2` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `пс-982`
--

INSERT INTO `пс-982` (`day`, `number`, `is_odd_even`, `is_groups`, `class`, `class_even`, `class_odd`, `class_gr1`, `class_gr2`, `class_even_gr1`, `class_even_gr2`, `class_odd_gr1`, `class_odd_gr2`) VALUES
(1, 1, 1, 0, '', 'Что-то', 'И ещё', '', '', '', '', '', ''),
(1, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(1, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(2, 6, 0, 0, 'Кавото', '', '', '', '', '', '', '', ''),
(2, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(3, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(4, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 3, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(5, 7, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 1, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 2, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 3, 1, 1, '', '', '', '', '', 'Одент', 'Давнт', 'Тринт', 'Четырент'),
(6, 4, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 5, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 6, 0, 0, '', '', '', '', '', '', '', '', ''),
(6, 7, 0, 0, '', '', '', '', '', '', '', '', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `times`
--
ALTER TABLE `times`
  ADD PRIMARY KEY (`number_of_class`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
